RhinoInside.Revit API Documentation
ColorWithTransparencyConverter.ToColorWithTransparency Method
 Converts the specified Color to an equivalent Autodesk.Revit.DB.ColorWithTransparency.
 Namespace: RhinoInside.Revit.Convert.System.Drawing
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Autodesk.Revit.DB.ColorWithTransparency ToColorWithTransparency(
	this Color color
)
@staticmethod
def ToColorWithTransparency(
	color: Color
) -> Autodesk.Revit.DB.ColorWithTransparency
Parameters
color
Type: System.Drawing.Color
System color to convert.
Return Value
Type: Autodesk.Revit.DB.ColorWithTransparency
Revit color that is equivalent to the provided System color.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Color. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToColorWithTransparency(Color) as extension method:
using System.Drawing;
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.System.Drawing;
DB.ColorWithTransparency revitColor = color.ToColorWithTransparency();
import clr
clr.AddReference("System.Drawing")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
from System.Drawing import Color
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.System.Drawing
clr.ImportExtensions(RhinoInside.Revit.Convert.System.Drawing)
revit_color = color.ToColor()    # type: DB.ColorWithTransparency
 Using ToColorWithTransparency(Color) as static method:
using System.Drawing;
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.System.Drawing;
DB.ColorWithTransparency revitColor = ColorConverter.ToColorWithTransparency(color)
import clr
clr.AddReference("System.Drawing")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
clr.AddReference("Eto")
from System.Drawing import Color
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.System.Drawing.ColorConverter as CC
revit_color = CC.ToColorWithTransparency(color)    # type: DB.ColorWithTransparency
See Also
Reference
ColorWithTransparencyConverter Class
RhinoInside.Revit.Convert.System.Drawing Namespace